Revit 2027 API
BuiltInFailures.FamilyFailures.FailedWhenLoadingFamily Property
 Some unlocked labeled dimensions prevent family from loading. Please try to lock unlocked labeled dimensions and load again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedWhenLoadingFamily { get; }
Public Shared ReadOnly Property FailedWhenLoadingFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedWhenLoadingFamily {
	FailureDefinitionId^ get ();
}
static member FailedWhenLoadingFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace